#pragma once

/*2.Реалізувати шаблонну функцію Ordering("Впорядкування"), з трьома шаблонними параметрами однакового типу,
яка б впорядковувала параметри за зростанням. Приклад: якщо а < b < c, то виклик Ordering(a, b, c)
нічого не змінює, інакше – обмін значеннями a, b, c так, щоб нерівність була вірною.*/



template < typename U >
void Ordering(U &a, U &b, U &c) {

	if (!(a < b && b < c)) {
		
		if (a > b) {
			U tmp = a;
			a = b;
			b = tmp;
		}

		if (a > c) {
			U tmp = a;
			a = c;
			c = tmp;
		}

		if (c < b) {
			U tmp = c;
			c = b;
			b = tmp;
		}
	}
}