#include <iostream>
using namespace std;

int main() {
 /* 7.	Космічна ракета набула швидкості V. Повідомити про подальшу долю ракети,
якщо V >  9,7 км/с – стане штучним супутником Землі, 
якщо V > 11,2 км/с – стане штучним супутником Сонця, 
якщо V > 16,7 км/с – залишить межі Сонячної системи, 
інакше – впаде на Землю. Використати вкладені команди розгалуження.*/

float V;
cout << "Enter V: ";
cin >> V;

if (V > 9.7 && V < 11.2) {
	cout << " стане штучним супутником Землі" << endl;
}
if (V > 11.2 && V < 16.7) {
	cout << " стане штучним супутником Сонця" << endl;
}
if (V > 16.7) {
	cout << " залишить межі Сонячної системи" << endl;
}
if (V <= 9.7) {
	cout << "впаде на Землю" << endl;
}
}
